Revit 2026 API

# FilledRegionFailures Properties

---

The BuiltInFailuresFilledRegionFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | BadViewType | [Filled Region Name] can't be placed in 3D Views. |
|  | CannotDrawFilledRegion | Can't draw [Filled Region Name]. |
|  | CannotDrawFilledRegionError | Can't draw [Filled Region Name]. |

#### Reference

BuiltInFailuresFilledRegionFailures Class

Autodesk.Revit.DB Namespace